Revit 2024 API
BuiltInFailures.StairRampFailures.RampDoesntReachOffset Property
 The ramp is not long enough to reach the top constraint plus top offset. Change the slope or increase the length of the ramp.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RampDoesntReachOffset { get; }
Visual Basic
Public Shared ReadOnly Property RampDoesntReachOffset As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RampDoesntReachOffset {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace